Repository: starcat-app/Starcat
Catalog: Starcat/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, id, it, ja, ko, nl, pl, pt_br, ru, tr, uk, vi, zh_hans, zh_hant

# rag.workspace.context.budget.help.footnote
source: Token counts are local estimates for budget boundaries, not exact provider billing.
ar: أعداد الرموز هي تقديرات محلية لحدود الميزانية، وليست فواتير دقيقة من المزود.
de: Token-Zahlen sind lokale Schätzungen für Budgetgrenzen, keine exakte Anbieterabrechnung.
es: Los recuentos de tokens son estimaciones locales para los límites del presupuesto, no la facturación exacta del proveedor.
fr: Les comptes de jetons sont des estimations locales pour les limites budgétaires, pas la facturation exacte du fournisseur.
id: Hitungan token adalah perkiraan lokal untuk batas anggaran, bukan penagihan penyedia yang tepat.
it: I conteggi dei token sono stime locali per i limiti di budget, non la fatturazione esatta del provider.
ja: トークン数は予算境界のローカル推定値であり、プロバイダーの正確な請求額ではありません。
ko: 토큰 수는 예산 경계에 대한 로컬 추정치이며, 정확한 제공자 청구 금액이 아닙니다.
nl: Tokentellingen zijn lokale schattingen voor budgetgrenzen, niet exacte providerfacturering.
pl: Liczby tokenów to lokalne szacunki granic budżetu, a nie dokładne rozliczenia dostawcy.
pt_br: As contagens de tokens são estimativas locais para limites de orçamento, não o faturamento exato do provedor.
ru: Количество токенов — это локальные оценки для границ бюджета, а не точный биллинг провайдера.
tr: Token sayıları, bütçe sınırları için yerel tahminlerdir, kesin sağlayıcı faturalaması değildir.
uk: Кількість токенів — це локальні оцінки для меж бюджету, а не точний розрахунок постачальника.
vi: Số lượng token là ước tính cục bộ cho ranh giới ngân sách, không phải hóa đơn chính xác của nhà cung cấp.
zh_hans: 所有 token 均为本地估算，用于预算边界判断，不代表 Provider 精确计费。
zh_hant: 所有 token 均為本地估算，用於預算邊界判斷，不代表 Provider 精確計費。

# rag.workspace.context.evidence
source: Knowledge base citations
ar: استشهادات قاعدة المعرفة
de: Zitate aus der Wissensdatenbank
es: Citas de la base de conocimiento
fr: Citations de la base de connaissances
id: Kutipan basis pengetahuan
it: Citazioni dalla knowledge base
ja: ナレッジベースの引用
ko: 지식 베이스 인용
nl: Citaten uit kennisbank
pl: Cytaty z bazy wiedzy
pt_br: Citações da base de conhecimento
ru: Цитаты из базы знаний
tr: Bilgi tabanı alıntıları
uk: Цитати з бази знань
vi: Trích dẫn cơ sở tri thức
zh_hans: 知识库引用
zh_hant: 知識庫引用

# rag.workspace.context.historySummary
source: Conversation summary
ar: ملخص المحادثة
de: Gesprächszusammenfassung
es: Resumen de la conversación
fr: Résumé de la conversation
id: Ringkasan percakapan
it: Riepilogo conversazione
ja: 会話の要約
ko: 대화 요약
nl: Gesprekssamenvatting
pl: Podsumowanie konwersacji
pt_br: Resumo da conversa
ru: Сводка диалога
tr: Konuşma özeti
uk: Підсумок розмови
vi: Tóm tắt hội thoại
zh_hans: 对话摘要
zh_hant: 對話摘要

# rag.workspace.context.open
source: View context usage
ar: عرض استخدام السياق
de: Kontextnutzung anzeigen
es: Ver uso de contexto
fr: Voir l'utilisation du contexte
id: Lihat penggunaan konteks
it: Visualizza utilizzo contesto
ja: コンテキスト使用量を表示
ko: 컨텍스트 사용량 보기
nl: Contextgebruik bekijken
pl: Zobacz użycie kontekstu
pt_br: Ver uso de contexto
ru: Просмотреть использование контекста
tr: Bağlam kullanımını görüntüle
uk: Переглянути використання контексту
vi: Xem mức sử dụng ngữ cảnh
zh_hans: 查看上下文占用
zh_hant: 查看上下文佔用

# rag.workspace.context.percentFull
source: %lld%% Full
ar: %lld%% ممتلئ
de: %lld%% voll
es: %lld%% lleno
fr: %lld%% Plein
id: %lld%% Penuh
it: %lld%% Pieno
ja: %lld%% 使用中
ko: %lld%% 사용됨
nl: %lld%% vol
pl: %lld%% pełne
pt_br: %lld%% Cheio
ru: Заполнено на %lld%%
tr: %lld%% Dolu
uk: %lld%% заповнено
vi: %lld%% Đầy
zh_hans: %lld%% 已占用
zh_hant: %lld%% 已佔用

# rag.workspace.context.question
source: Question and plan
ar: السؤال والخطة
de: Frage und Plan
es: Pregunta y plan
fr: Question et plan
id: Pertanyaan dan rencana
it: Domanda e piano
ja: 質問と計画
ko: 질문 및 계획
nl: Vraag en plan
pl: Pytanie i plan
pt_br: Pergunta e plano
ru: Вопрос и план
tr: Soru ve plan
uk: Запитання та план
vi: Câu hỏi và kế hoạch
zh_hans: 问题与查询计划
zh_hant: 問題與查詢計劃

# rag.workspace.context.recentMessages
source: History messages
ar: رسائل السجل
de: Verlaufsnachrichten
es: Mensajes del historial
fr: Messages de l'historique
id: Pesan riwayat
it: Messaggi cronologia
ja: 履歴メッセージ
ko: 기록 메시지
nl: Geschiedenisberichten
pl: Wiadomości historii
pt_br: Mensagens do histórico
ru: Сообщения истории
tr: Geçmiş mesajları
uk: Повідомлення історії
vi: Tin nhắn lịch sử
zh_hans: 历史消息
zh_hant: 歷史訊息

# rag.workspace.context.remote
source: Remote context
ar: السياق البعيد
de: Remote-Kontext
es: Contexto remoto
fr: Contexte distant
id: Konteks jarak jauh
it: Contesto remoto
ja: リモートコンテキスト
ko: 원격 컨텍스트
nl: Externe context
pl: Kontekst zdalny
pt_br: Contexto remoto
ru: Удалённый контекст
tr: Uzak bağlam
uk: Віддалений контекст
vi: Ngữ cảnh từ xa
zh_hans: 远程上下文
zh_hant: 遠端上下文

# rag.workspace.context.repoContext
source: Project code
ar: كود المشروع
de: Projektcode
es: Código del proyecto
fr: Code du projet
id: Kode proyek
it: Codice progetto
ja: プロジェクトコード
ko: 프로젝트 코드
pl: Kod projektu
pt_br: Código do projeto
ru: Код проекта
tr: Proje kodu
uk: Код проєкту
vi: Mã dự án
zh_hans: 项目代码
zh_hant: 專案程式碼

# rag.workspace.context.reservedOutput
source: Reserved output
ar: الإخراج المحجوز
de: Reservierte Ausgabe
es: Salida reservada
fr: Sortie réservée
id: Output yang dicadangkan
it: Output riservato
ja: 予約済み出力
ko: 예약된 출력
nl: Gereserveerde uitvoer
pl: Zarezerwowane wyjście
pt_br: Saída reservada
ru: Зарезервированный вывод
tr: Ayrılmış çıktı
uk: Зарезервоване виведення
vi: Đầu ra dự trữ
zh_hans: 预留输出
zh_hant: 預留輸出

# rag.workspace.context.system
source: System prompt
ar: مطالبة النظام
es: Mensaje del sistema
fr: Prompt système
id: Prompt sistem
it: Prompt di sistema
ja: システムプロンプト
ko: 시스템 프롬프트
nl: Systeemprompt
pl: Prompt systemowy
pt_br: Prompt do sistema
ru: Системный промпт
tr: Sistem istemi
uk: Системна підказка
vi: Prompt hệ thống
zh_hans: 系统提示
zh_hant: 系統提示

# rag.workspace.context.title
source: Context usage
ar: استخدام السياق
de: Kontextnutzung
es: Uso de contexto
fr: Utilisation du contexte
id: Penggunaan konteks
it: Utilizzo contesto
ja: コンテキスト使用量
ko: 컨텍스트 사용량
nl: Contextgebruik
pl: Użycie kontekstu
pt_br: Uso de contexto
ru: Использование контекста
tr: Bağlam kullanımı
uk: Використання контексту
vi: Mức sử dụng ngữ cảnh
zh_hans: 上下文占用
zh_hant: 上下文佔用

# rag.workspace.context.tokensSummary
source: %@ / %@ Tokens
ar: %@ / %@ رمز
de: %@ / %@ Token
fr: %@ / %@ jetons
id: %@ / %@ Token
it: %@ / %@ Token
ja: %@ / %@ トークン
ko: %@ / %@ 토큰
pl: %@ / %@ tokenów
ru: %@ / %@ токенов
tr: %@ / %@ Token
uk: %@ / %@ токенів
vi: %@ / %@ Token

# rag.workspace.conversation.actions
source: Conversation actions
ar: إجراءات المحادثة
de: Unterhaltungsaktionen
es: Acciones de conversación
fr: Actions de la conversation
id: Tindakan percakapan
it: Azioni conversazione
ja: 会話アクション
ko: 대화 작업
nl: Gespreksacties
pl: Akcje konwersacji
pt_br: Ações da conversa
ru: Действия с диалогом
tr: Konuşma işlemleri
uk: Дії з розмовою
vi: Hành động hội thoại
zh_hans: 会话操作
zh_hant: 會話操作

# rag.workspace.conversation.copyAll
source: Copy entire conversation
ar: نسخ المحادثة بأكملها
de: Gesamte Unterhaltung kopieren
es: Copiar conversación completa
fr: Copier toute la conversation
id: Salin seluruh percakapan
it: Copia intera conversazione
ja: 会話全体をコピー
ko: 전체 대화 복사
nl: Hele gesprek kopiëren
pl: Kopiuj całą konwersację
pt_br: Copiar toda a conversa
ru: Копировать весь диалог
tr: Tüm konuşmayı kopyala
uk: Копіювати всю розмову
vi: Sao chép toàn bộ hội thoại
zh_hans: 复制全部对话
zh_hant: 複製全部對話

# rag.workspace.conversation.exportAll
source: Export entire conversation
ar: تصدير المحادثة بالكامل
de: Gesamte Unterhaltung exportieren
es: Exportar conversación completa
fr: Exporter toute la conversation
id: Ekspor seluruh percakapan
it: Esporta l'intera conversazione
ja: 会話全体をエクスポート
ko: 전체 대화 내보내기
nl: Volledig gesprek exporteren
pl: Eksportuj całą rozmowę
pt_br: Exportar conversa inteira
ru: Экспортировать весь разговор
tr: Tüm konuşmayı dışa aktar
uk: Експортувати всю розмову
vi: Xuất toàn bộ hội thoại
zh_hans: 导出全部对话
zh_hant: 匯出全部對話

# rag.workspace.conversation.loading
source: Loading conversation
ar: جارٍ تحميل المحادثة
de: Unterhaltung wird geladen
es: Cargando conversación
fr: Chargement de la conversation
id: Memuat percakapan
it: Caricamento conversazione
ja: 会話を読み込み中
ko: 대화 불러오는 중
nl: Gesprek laden
pl: Ładowanie rozmowy
pt_br: Carregando conversa
ru: Загрузка разговора
tr: Konuşma yükleniyor
uk: Завантаження розмови
vi: Đang tải hội thoại
zh_hans: 正在加载会话
zh_hant: 正在載入會話

# rag.workspace.conversation.moveToGroup
source: Move to group
ar: نقل إلى مجموعة
de: In Gruppe verschieben
es: Mover a grupo
fr: Déplacer vers le groupe
id: Pindahkan ke grup
it: Sposta nel gruppo
ja: グループに移動
ko: 그룹으로 이동
nl: Verplaatsen naar groep
pl: Przenieś do grupy
pt_br: Mover para grupo
ru: Переместить в группу
tr: Gruba taşı
uk: Перемістити до групи
vi: Di chuyển vào nhóm
zh_hans: 移动到分组
zh_hant: 移動到分組

# rag.workspace.conversation.pin
source: Pin to Top
ar: تثبيت في الأعلى
de: Oben anheften
es: Fijar al inicio
fr: Épingler en haut
id: Sematkan ke Atas
it: Fissa in alto
ja: 先頭に固定
ko: 상단에 고정
nl: Bovenaan vastzetten
pl: Przypnij na górę
pt_br: Fixar no topo
ru: Закрепить вверху
tr: En Üste Sabitle
uk: Закріпити зверху
vi: Ghim lên đầu
zh_hans: 置顶
zh_hant: 置頂

# rag.workspace.conversation.rename
source: Rename
ar: إعادة تسمية
de: Umbenennen
es: Renombrar
fr: Renommer
id: Ubah nama
it: Rinomina
ja: 名前を変更
ko: 이름 바꾸기
nl: Hernoemen
pl: Zmień nazwę
pt_br: Renomear
ru: Переименовать
tr: Yeniden Adlandır
uk: Перейменувати
vi: Đổi tên
zh_hans: 重命名
zh_hant: 重新命名

# rag.workspace.conversation.rename.placeholder
source: Conversation title
ar: عنوان المحادثة
de: Unterhaltungstitel
es: Título de la conversación
fr: Titre de la conversation
id: Judul percakapan
it: Titolo conversazione
ja: 会話のタイトル
ko: 대화 제목
nl: Gesprekstitel
pl: Tytuł rozmowy
pt_br: Título da conversa
ru: Название разговора
tr: Konuşma başlığı
uk: Назва розмови
vi: Tiêu đề hội thoại
zh_hans: 会话标题
zh_hant: 會話標題

# rag.workspace.conversation.rename.title
source: Rename Conversation
ar: إعادة تسمية المحادثة
de: Unterhaltung umbenennen
es: Renombrar conversación
fr: Renommer la conversation
id: Ubah Nama Percakapan
it: Rinomina conversazione
ja: 会話の名前を変更
ko: 대화 이름 바꾸기
nl: Gesprek hernoemen
pl: Zmień nazwę rozmowy
pt_br: Renomear Conversa
ru: Переименовать разговор
tr: Konuşmayı Yeniden Adlandır
uk: Перейменувати розмову
vi: Đổi tên hội thoại
zh_hans: 重命名会话
zh_hant: 重新命名會話

# rag.workspace.conversation.showMore
source: Show More
ar: عرض المزيد
de: Mehr anzeigen
es: Mostrar más
fr: Afficher plus
id: Tampilkan lainnya
it: Mostra altro
ja: さらに表示
ko: 더 보기
nl: Meer weergeven
pl: Pokaż więcej
pt_br: Mostrar mais
ru: Показать ещё
tr: Daha fazla göster
uk: Показати більше
vi: Hiển thị thêm
zh_hans: 展开更多
zh_hant: 展開更多

# rag.workspace.conversation.ungroup
source: Remove from group
ar: إزالة من المجموعة
de: Aus Gruppe entfernen
es: Eliminar del grupo
fr: Retirer du groupe
id: Hapus dari grup
it: Rimuovi dal gruppo
ja: グループから削除
ko: 그룹에서 제거
nl: Uit groep verwijderen
pl: Usuń z grupy
pt_br: Remover do grupo
ru: Удалить из группы
tr: Gruptan çıkar
uk: Вилучити з групи
vi: Xóa khỏi nhóm
zh_hans: 移出分组
zh_hant: 移出分組

# rag.workspace.conversation.unpin
source: Unpin
ar: إلغاء التثبيت
de: Loslösen
es: Desfijar
fr: Désépingler
id: Lepas sematan
it: Rimuovi fissaggio
ja: 固定を解除
ko: 고정 해제
nl: Losmaken
pl: Odepnij
pt_br: Desafixar
ru: Открепить
tr: Sabitlemeyi kaldır
uk: Відкріпити
vi: Bỏ ghim
zh_hans: 取消置顶
zh_hant: 取消置頂

# rag.workspace.debug.category.conversationTitle
source: Title generation
ar: توليد العنوان
de: Titelgenerierung
es: Generación de título
fr: Génération du titre
id: Pembuatan judul
it: Generazione titolo
ja: タイトル生成
ko: 제목 생성
nl: Titelgeneratie
pl: Generowanie tytułu
pt_br: Geração de título
ru: Генерация заголовка
tr: Başlık oluşturma
uk: Генерація заголовка
vi: Tạo tiêu đề
zh_hans: 标题生成
zh_hant: 標題生成

# rag.workspace.debug.category.questionAnswer
source: Knowledge base Q&A
ar: أسئلة وأجوبة قاعدة المعرفة
de: Wissensdatenbank Q&A
es: Preguntas y respuestas de la base de conocimiento
fr: Q&R sur la base de connaissances
id: Tanya Jawab basis pengetahuan
it: Domande e risposte knowledge base
ja: ナレッジベースQ&A
ko: 지식 베이스 Q&A
nl: Kennisbank Q&A
pl: Pytania i odpowiedzi z bazy wiedzy
pt_br: Perguntas e respostas da base de conhecimento
ru: База знаний: вопросы и ответы
tr: Bilgi tabanı S&S
uk: Q&A з бази знань
vi: Hỏi đáp cơ sở tri thức
zh_hans: 知识库问答
zh_hant: 知識庫問答

# rag.workspace.debug.clear
source: Clear debug data
ar: مسح بيانات التصحيح
de: Debug-Daten löschen
es: Borrar datos de depuración
fr: Effacer les données de débogage
id: Hapus data debug
it: Cancella dati debug
ja: デバッグデータを消去
ko: 디버그 데이터 지우기
nl: Debuggegevens wissen
pl: Wyczyść dane debugowania
pt_br: Limpar dados de depuração
ru: Очистить отладочные данные
tr: Hata ayıklama verilerini temizle
uk: Очистити дані налагодження
vi: Xóa dữ liệu gỡ lỗi
zh_hans: 清空调试数据
zh_hant: 清空調試資料

# rag.workspace.debug.clear.confirm.message
source: This permanently deletes the RAG debug traces in memory and saved Debug JSON files for the current conversation. It does not delete messages, the knowledge base index, repository data, or debug data from other conversations.
ar: يؤدي هذا إلى حذف آثار تصحيح RAG في الذاكرة وملفات JSON المحفوظة بشكل دائم للمحادثة الحالية. لا يحذف الرسائل أو فهرس قاعدة المعرفة أو بيانات المستودع أو بيانات التصحيح من المحادثات الأخرى.
de: Dies löscht dauerhaft die RAG-Debug-Traces im Speicher und gespeicherte Debug-JSON-Dateien für die aktuelle Unterhaltung. Es löscht keine Nachrichten, den Wissensdatenbank-Index, Repository-Daten oder Debug-Daten aus anderen Unterhaltungen.
es: Esto elimina permanentemente los rastros de depuración RAG en memoria y los archivos JSON de depuración guardados para la conversación actual. No elimina mensajes, el índice de la base de conocimiento, datos del repositorio ni datos de depuración de otras conversaciones.
fr: Cela supprime définitivement les traces de débogage RAG en mémoire et les fichiers JSON de débogage sauvegardés pour la conversation en cours. Cela ne supprime pas les messages, l'index de la base de connaissances, les données du dépôt ni les données de débogage des autres conversations.
id: Ini akan menghapus permanen jejak debug RAG di memori dan file Debug JSON yang tersimpan untuk percakapan saat ini. Ini tidak menghapus pesan, indeks basis pengetahuan, data repositori, atau data debug dari percakapan lain.
it: Questa operazione elimina definitivamente le tracce di debug RAG in memoria e i file JSON di debug salvati per la conversazione corrente. Non elimina messaggi, l'indice della knowledge base, i dati del repository o i dati di debug di altre conversazioni.
ja: これにより、現在の会話のRAGデバッグトレース（メモリ内）と保存されたデバッグJSONファイルが完全に削除されます。メッセージ、ナレッジベースインデックス、リポジトリデータ、他の会話のデバッグデータは削除されません。
ko: 현재 대화의 메모리 내 RAG 디버그 추적과 저장된 Debug JSON 파일을 영구 삭제합니다. 메시지, 지식 베이스 인덱스, 저장소 데이터 또는 다른 대화의 디버그 데이터는 삭제되지 않습니다.
nl: Hiermee worden de RAG-debugtraces in het geheugen en opgeslagen Debug JSON-bestanden voor het huidige gesprek permanent verwijderd. Berichten, de kennisbankindex, repositorygegevens of debuggegevens van andere gesprekken worden niet verwijderd.
pl: Spowoduje to trwałe usunięcie śladów debugowania RAG w pamięci i zapisanych plików JSON debugowania dla bieżącej rozmowy. Nie usuwa wiadomości, indeksu bazy wiedzy, danych repozytorium ani danych debugowania z innych rozmów.
pt_br: Isso exclui permanentemente os rastros de depuração RAG na memória e os arquivos JSON de depuração salvos para a conversa atual. Não exclui mensagens, o índice da base de conhecimento, dados do repositório ou dados de depuração de outras conversas.
ru: Это навсегда удалит отладочные трассировки RAG в памяти и сохранённые файлы Debug JSON для текущего разговора. Сообщения, индекс базы знаний, данные репозитория и отладочные данные других разговоров не будут затронуты.
tr: Bu işlem, geçerli konuşma için bellekteki RAG hata ayıklama izlerini ve kaydedilmiş Debug JSON dosyalarını kalıcı olarak siler. Mesajları, bilgi tabanı dizinini, depo verilerini veya diğer konuşmalardaki hata ayıklama verilerini silmez.
uk: Це остаточно видаляє трасування налагодження RAG у пам'яті та збережені файли Debug JSON для поточної розмови. Це не видаляє повідомлення, індекс бази знань, дані репозиторію або дані налагодження з інших розмов.
vi: Thao tác này xóa vĩnh viễn các dấu vết gỡ lỗi RAG trong bộ nhớ và các tệp JSON gỡ lỗi đã lưu cho hội thoại hiện tại. Nó không xóa tin nhắn, chỉ mục cơ sở tri thức, dữ liệu kho lưu trữ hoặc dữ liệu gỡ lỗi từ các hội thoại khác.
zh_hans: 这会永久删除当前会话的内存 RAG 调试轨迹和已保存的 Debug JSON 文件。不会删除对话消息、知识库索引、仓库数据或其他会话的调试数据。
zh_hant: 這會永久刪除目前會話的記憶體 RAG 調試軌跡和已儲存的 Debug JSON 檔案。不會刪除對話訊息、知識庫索引、倉庫資料或其他會話的調試資料。

# rag.workspace.debug.clear.confirm.title
source: Clear debug data?
ar: هل تريد مسح بيانات التصحيح؟
de: Debug-Daten löschen?
es: ¿Borrar datos de depuración?
fr: Effacer les données de débogage ?
id: Hapus data debug?
it: Cancellare i dati di debug?
ja: デバッグデータを消去しますか？
ko: 디버그 데이터를 지우시겠습니까?
nl: Debuggegevens wissen?
pl: Wyczyścić dane debugowania?
pt_br: Limpar dados de depuração?
ru: Очистить отладочные данные?
tr: Hata ayıklama verileri temizlensin mi?
uk: Очистити дані налагодження?
vi: Xóa dữ liệu gỡ lỗi?
zh_hans: 清空调试数据？
zh_hant: 清空調試資料？

# rag.workspace.debug.copy
source: Copy debug record
ar: نسخ سجل التصحيح
de: Debug-Eintrag kopieren
es: Copiar registro de depuración
fr: Copier l'enregistrement de débogage
id: Salin catatan debug
it: Copia record debug
ja: デバッグレコードをコピー
ko: 디버그 기록 복사
nl: Debugrecord kopiëren
pl: Kopiuj rekord debugowania
pt_br: Copiar registro de depuração
ru: Копировать запись отладки
tr: Hata ayıklama kaydını kopyala
uk: Копіювати запис налагодження
vi: Sao chép bản ghi gỡ lỗi
zh_hans: 复制调试记录
zh_hant: 複製調試記錄

# rag.workspace.debug.elapsedFormat
source: %.1fs
ar: %.1f ثانية
id: %.1f detik
ja: %.1f秒
ko: %.1f초
ru: %.1f с
uk: %.1f с
zh_hans: %.1f 秒
zh_hant: %.1f 秒

# rag.workspace.debug.empty
source: Send a question to capture its RAG execution trace.
ar: أرسل سؤالاً لالتقاط أثر تنفيذ RAG الخاص به.
de: Senden Sie eine Frage, um deren RAG-Ausführungsspur zu erfassen.
es: Envíe una pregunta para capturar su rastro de ejecución RAG.
fr: Envoyez une question pour capturer sa trace d'exécution RAG.
id: Kirim pertanyaan untuk menangkap jejak eksekusi RAG.
it: Invia una domanda per catturarne la traccia di esecuzione RAG.
ja: 質問を送信すると、そのRAG実行トレースがキャプチャされます。
ko: 질문을 보내면 RAG 실행 추적이 캡처됩니다.
nl: Stuur een vraag om het RAG-uitvoeringstraject vast te leggen.
pl: Wyślij pytanie, aby przechwycić jego ślad wykonania RAG.
pt_br: Envie uma pergunta para capturar seu rastro de execução RAG.
ru: Отправьте вопрос, чтобы захватить трассировку выполнения RAG.
tr: RAG yürütme izini yakalamak için bir soru gönderin.
uk: Надішліть запитання, щоб захопити трасування виконання RAG.
vi: Gửi một câu hỏi để ghi lại dấu vết thực thi RAG của nó.
zh_hans: 发送一个问题后，将在这里显示本轮 RAG 执行记录。
zh_hant: 發送一個問題後，將在這裡顯示本輪 RAG 執行記錄。

# rag.workspace.debug.enabled
source: RAG Debug Mode
ar: وضع تصحيح RAG
de: RAG-Debug-Modus
es: Modo de depuración RAG
fr: Mode débogage RAG
id: Mode Debug RAG
it: Modalità debug RAG
ja: RAGデバッグモード
ko: RAG 디버그 모드
nl: RAG-debugmodus
pl: Tryb debugowania RAG
pt_br: Modo de Depuração RAG
ru: Режим отладки RAG
tr: RAG Hata Ayıklama Modu
uk: Режим налагодження RAG
vi: Chế độ gỡ lỗi RAG
zh_hans: RAG 调试模式
zh_hant: RAG 調試模式

# rag.workspace.debug.export
source: Export this debug record as Markdown
ar: تصدير سجل التصحيح هذا بتنسيق Markdown
de: Diesen Debug-Eintrag als Markdown exportieren
es: Exportar este registro de depuración como Markdown
fr: Exporter cet enregistrement de débogage au format Markdown
id: Ekspor catatan debug ini sebagai Markdown
it: Esporta questo record debug come Markdown
ja: このデバッグレコードをMarkdownとしてエクスポート
ko: 이 디버그 기록을 Markdown으로 내보내기
nl: Dit debugrecord exporteren als Markdown
pl: Eksportuj ten rekord debugowania jako Markdown
pt_br: Exportar este registro de depuração como Markdown
ru: Экспортировать эту запись отладки как Markdown
tr: Bu hata ayıklama kaydını Markdown olarak dışa aktar
uk: Експортувати цей запис налагодження як Markdown
vi: Xuất bản ghi gỡ lỗi này dưới dạng Markdown
zh_hans: 导出此调试记录为 Markdown
zh_hant: 匯出此調試記錄為 Markdown

# rag.workspace.debug.privacy.repoContext
source: Debug traces are stored locally. The final Prompt stage may contain complete repository-insights and project-code XML; clearing this conversation's traces deletes that local debug copy.
ar: يتم تخزين آثار التصحيح محليًا. قد تحتوي مرحلة الموجه النهائية على XML كامل لكود المشروع؛ يؤدي مسح آثار هذه المحادثة إلى حذف نسخة التصحيح المحلية تلك.
de: Debug-Traces werden lokal gespeichert. Die finale Prompt-Stufe kann das vollständige Projektcode-XML enthalten; das Löschen der Traces dieser Unterhaltung löscht diese lokale Debug-Kopie.
es: Los rastros de depuración se almacenan localmente. La etapa final del Prompt puede contener el XML completo del código del proyecto; borrar los rastros de esta conversación elimina esa copia local de depuración.
fr: Les traces de débogage sont stockées localement. L'étape finale de l'invite peut contenir le code XML complet du projet ; effacer les traces de cette conversation supprime cette copie locale de débogage.
id: Jejak debug disimpan secara lokal. Tahap Prompt akhir mungkin berisi XML kode proyek lengkap; menghapus jejak percakapan ini akan menghapus salinan debug lokal tersebut.
it: Le tracce di debug sono memorizzate localmente. La fase finale del Prompt può contenere l'XML completo del codice del progetto; cancellare le tracce di questa conversazione elimina quella copia locale di debug.
ja: デバッグトレースはローカルに保存されます。最終的なプロンプト段階には完全なプロジェクトコードXMLが含まれる場合があり、この会話のトレースを消去すると、そのローカルデバッグコピーが削除されます。
ko: 디버그 추적은 로컬에 저장됩니다. 최종 프롬프트 단계에는 전체 프로젝트 코드 XML이 포함될 수 있습니다. 이 대화의 추적을 지우면 로컬 디버그 복사본이 삭제됩니다.
nl: Debugtraces worden lokaal opgeslagen. De uiteindelijke promptfase kan de volledige projectcode-XML bevatten; het wissen van de traces van dit gesprek verwijdert die lokale debugkopie.
pl: Ślady debugowania są przechowywane lokalnie. Końcowy etap promptu może zawierać pełny XML kodu projektu; wyczyszczenie śladów tej rozmowy usuwa tę lokalną kopię debugowania.
pt_br: Os rastros de depuração são armazenados localmente. O estágio final do Prompt pode conter o XML completo do código do projeto; limpar os rastros desta conversa exclui essa cópia de depuração local.
ru: Отладочные трассировки хранятся локально. Финальный этап промпта может содержать полный XML кода проекта; очистка трассировок этого разговора удалит локальную копию отладки.
tr: Hata ayıklama izleri yerel olarak depolanır. Son İstem aşaması, tam proje kodu XML'ini içerebilir; bu konuşmanın izlerini temizlemek, o yerel hata ayıklama kopyasını siler.
uk: Трасування налагодження зберігаються локально. Останній етап Prompt може містити повний XML коду проєкту; очищення трасувань цієї розмови видаляє цю локальну копію.
vi: Dấu vết gỡ lỗi được lưu trữ cục bộ. Giai đoạn Prompt cuối cùng có thể chứa toàn bộ XML mã dự án; xóa dấu vết của hội thoại này sẽ xóa bản sao gỡ lỗi cục bộ đó.
zh_hans: 调试记录保存在本地；最终 Prompt 阶段可能包含完整仓库洞察与项目代码 XML。清空当前会话调试记录会删除这份本地调试副本。
zh_hant: 調試記錄儲存在本地；最終 Prompt 階段可能包含完整專案程式碼 XML。清空目前會話調試記錄會刪除這份本地調試副本。

# rag.workspace.debug.rerank.applied.title
source: Applied Order
ar: الترتيب المطبق
de: Angewandte Reihenfolge
es: Orden aplicado
fr: Ordre appliqué
id: Urutan yang Diterapkan
it: Ordine applicato
ja: 適用順序
ko: 적용된 순서
nl: Toegepaste volgorde
pl: Zastosowana kolejność
pt_br: Ordem Aplicada
ru: Применённый порядок
tr: Uygulanan Sıra
uk: Застосований порядок
vi: Thứ tự đã áp dụng
zh_hans: 最终应用顺序
zh_hant: 最終應用順序
